ubuntu_process.org
#+TITLE:     进程和端口
#+AUTHOR:    Joseph Pan
#+EMAIL:     cs.wzpan@gmail.com
#+DATE:      2012-04-11 Wed
#+DESCRIPTION: Ubuntu进程和端口的有关命令
#+KEYWORDS: 进程 端口 Ubuntu
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   ./ubuntu_index.html


* 进程

** 查看当前的内存使用情况

    #+begin_example
    free
    #+end_example

    usage: free [-b|-k|-m|-g] [-l] [-o] [-t] [-s delay] [-c count] [-V]

    #+begin_example
  -b,-k,-m,-g show output in bytes, KB, MB, or GB
  -l show detailed low and high memory statistics
  -o use old format (no -/+buffers/cache line)
  -t display total for RAM + swap
  -s update every [delay] seconds
  -c update [count] times
  -V display version information and exit    
    #+end_example

** 动态显示进程执行情况

    #+begin_example
    top
    top指令运行时输入H或？打开帮助窗口，输入Q退出指令。
    #+end_example

** 查看当前有哪些进程

    #+begin_example
    ps -AFL
    #+end_example

** 查看进程的启动时间

    #+begin_example
    ps -A -opid,stime,etime,args
    #+end_example
    
** 查看当前用户程序实际内存占用，并排序

    #+begin_example
    ps -u $USER -o pid,rss,cmd --sort -rss
    #+end_example

** 统计程序的内存耗用

    #+begin_example
    ps -eo fname,rss|awk '{arr[$1]+=$2} END {for (i in arr) {print i,arr[i]}}'|sort -k2 -nr
    #+end_example

** 按cpu利用率从大到小排列进程

    #+begin_example
    ps -eo "%C  : %p : %z : %a"|sort  -nr
    ps aux --sort -pcpu |head -n 20
    #+end_example

** 查看当前进程树
    
    #+begin_example
    pstree
    #+end_example
    
** 中止一个进程
    #+begin_example
    kill 进程号(就是ps -A中的第一列的数字)
    或者 killall 进程名
    #+end_example
    强制中止一个进程(在上面进程中止不成功的时候使用)
    #+begin_example
    kill -9 进程号
    或者 killall -9 进程名    
    #+end_example
    图形方式中止一个程序
    #+begin_example
    xkill 出现骷髅标志的鼠标，点击需要中止的程序即可
    #+end_example

** 查看进程打开的文件

    #+begin_example
    lsof -p 进程的pid
    #+end_example
    
** 显示开启文件abc.txt的进程
    #+begin_example
    lsof abc.txt 
    #+end_example

** 显示22端口现在运行什么程序
    #+begin_example
    lsof -i :22 
    #+end_example

** 显示nsd进程现在打开的文件
    #+begin_example
    lsof -c nsd
    #+end_example

** 在後台运行程序，退出登录後，并不结束程序
    #+begin_example
    nohup 程序 &
    #查看中间运行情况　tail nohup
    #+end_example
    
** 清除僵尸进程

    #+begin_example
    ps -eal | awk '{ if ($2 == "Z") {print $4}}' | xargs sudo kill -9
    #+end_example


* 端口
  
** 查看当前监听80端口的程序

    #+begin_example
    lsof -i 80
    #+end_example

** 查看当前系统所有的监听端口

    #+begin_example
    nc -zv localhost 1-65535
    #+end_example

  
     
