ubuntu_process.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>进程和端口</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="进程和端口"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu进程和端口的有关命令"/>
<meta name="keywords" content="进程 端口 Ubuntu"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">进程和端口</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 进程</a>
<ul>
<li><a href="#sec-1-1">1.1 查看当前的内存使用情况</a></li>
<li><a href="#sec-1-2">1.2 动态显示进程执行情况</a></li>
<li><a href="#sec-1-3">1.3 查看当前有哪些进程</a></li>
<li><a href="#sec-1-4">1.4 查看进程的启动时间</a></li>
<li><a href="#sec-1-5">1.5 查看当前用户程序实际内存占用，并排序</a></li>
<li><a href="#sec-1-6">1.6 统计程序的内存耗用</a></li>
<li><a href="#sec-1-7">1.7 按cpu利用率从大到小排列进程</a></li>
<li><a href="#sec-1-8">1.8 查看当前进程树</a></li>
<li><a href="#sec-1-9">1.9 中止一个进程</a></li>
<li><a href="#sec-1-10">1.10 查看进程打开的文件</a></li>
<li><a href="#sec-1-11">1.11 显示开启文件abc.txt的进程</a></li>
<li><a href="#sec-1-12">1.12 显示22端口现在运行什么程序</a></li>
<li><a href="#sec-1-13">1.13 显示nsd进程现在打开的文件</a></li>
<li><a href="#sec-1-14">1.14 在後台运行程序，退出登录後，并不结束程序</a></li>
<li><a href="#sec-1-15">1.15 清除僵尸进程</a></li>
</ul>
</li>
<li><a href="#sec-2">2 端口</a>
<ul>
<li><a href="#sec-2-1">2.1 查看当前监听80端口的程序</a></li>
<li><a href="#sec-2-2">2.2 查看当前系统所有的监听端口</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 进程</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 查看当前的内存使用情况</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">free
</pre>


<p>
    usage: free [-b|-k|-m|-g] [-l] [-o] [-t] [-s delay] [-c count] [-V]
</p>



<pre class="example">-b,-k,-m,-g show output in bytes, KB, MB, or GB
-l show detailed low and high memory statistics
-o use old format (no -/+buffers/cache line)
-t display total for RAM + swap
-s update every [delay] seconds
-c update [count] times
-V display version information and exit    
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 动态显示进程执行情况</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">top
top指令运行时输入H或？打开帮助窗口，输入Q退出指令。
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 查看当前有哪些进程</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">ps -AFL
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 查看进程的启动时间</h3>
<div class="outline-text-3" id="text-1-4">





<pre class="example">ps -A -opid,stime,etime,args
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 查看当前用户程序实际内存占用，并排序</h3>
<div class="outline-text-3" id="text-1-5">





<pre class="example">ps -u $USER -o pid,rss,cmd --sort -rss
</pre>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 统计程序的内存耗用</h3>
<div class="outline-text-3" id="text-1-6">





<pre class="example">ps -eo fname,rss|awk '{arr[$1]+=$2} END {for (i in arr) {print i,arr[i]}}'|sort -k2 -nr
</pre>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 按cpu利用率从大到小排列进程</h3>
<div class="outline-text-3" id="text-1-7">





<pre class="example">ps -eo "%C  : %p : %z : %a"|sort  -nr
ps aux --sort -pcpu |head -n 20
</pre>


</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 查看当前进程树</h3>
<div class="outline-text-3" id="text-1-8">





<pre class="example">pstree
</pre>


</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 中止一个进程</h3>
<div class="outline-text-3" id="text-1-9">




<pre class="example">kill 进程号(就是ps -A中的第一列的数字)
或者 killall 进程名
</pre>

<p>
    强制中止一个进程(在上面进程中止不成功的时候使用)
</p>


<pre class="example">kill -9 进程号
或者 killall -9 进程名    
</pre>

<p>
    图形方式中止一个程序
</p>


<pre class="example">xkill 出现骷髅标志的鼠标，点击需要中止的程序即可
</pre>


</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 查看进程打开的文件</h3>
<div class="outline-text-3" id="text-1-10">





<pre class="example">lsof -p 进程的pid
</pre>


</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> 显示开启文件abc.txt的进程</h3>
<div class="outline-text-3" id="text-1-11">




<pre class="example">lsof abc.txt 
</pre>


</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> 显示22端口现在运行什么程序</h3>
<div class="outline-text-3" id="text-1-12">




<pre class="example">lsof -i :22 
</pre>


</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> 显示nsd进程现在打开的文件</h3>
<div class="outline-text-3" id="text-1-13">




<pre class="example">lsof -c nsd
</pre>


</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> 在後台运行程序，退出登录後，并不结束程序</h3>
<div class="outline-text-3" id="text-1-14">




<pre class="example">nohup 程序 &amp;
#查看中间运行情况　tail nohup
</pre>


</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> 清除僵尸进程</h3>
<div class="outline-text-3" id="text-1-15">





<pre class="example">ps -eal | awk '{ if ($2 == "Z") {print $4}}' | xargs sudo kill -9
</pre>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 端口</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 查看当前监听80端口的程序</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">lsof -i 80
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 查看当前系统所有的监听端口</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">nc -zv localhost 1-65535
</pre>




</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
